app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @movie = Movie.find(params[:id]) unless Movie.find_by_id(params[:id]).nil?

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
UPDATE "movies" SET "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["release_date", "2023-02-28"], ["updated_at", "2024-04-25 23:23:15.380056"], ["id", 21]]
---
  def update
    @movie = Movie.find(params[:id])

    if @movie.update(movie_params)

INSERT INTO "movies" ("title", "rating", "release_date", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save